/*
******************* (C) COPYRIGHT 2015 Air Nano Team ***************************
 * 模块名称 : 主程序模块
 * 文件名   ：main.c
 * 描述     ：系统初始化         
 * 实验平台 ：HT_Hawk
 * 库版本   ：ST3.5.0
 * 论坛     ：http://www.airnano.cn
*********************************************************************************
*/

#include "board_config.h"

/*
*********************************************************************************************************
*	函 数 名: main
*	功能说明: c程序入口
*	形    参：无
*	返 回 值: 错误代码(无需处理)
*********************************************************************************************************
*【2015年8月14日01:32:02】
*/
Mark_t mark;	  //程序执行标志位【外部变量】

int main(void)
{
	u16 Time = 5;		//启动延时函数

	Bootloader_Set(); //boot_loader 相关配置	
	InitBoard();		  //硬件初始化	
	Sensor_Init();	  //传感器初始化
	paramLoad();		  //加载参数	

	while(Time--)	
	{
		delay_ms(1000); //延时3s
	}
	/* 开定时中断 */
	EnTIMER;    		//(使用了函数宏定义)
	while(1)
	{
		/*-------------程序选择开关-----------------*/
		/*-功能0： KEY0 = 0 & KYE1 = 0【A——>B】*/
		if (KEY1==0 & KEY2==0) //11.8V
		{
			Sign_Video = 1;	//输出摄像头启动信号
			mark.Mark_0 = 1;
			loop();
		}
		/*-功能1： KEY0 = 0 & KYE1 = 1【（停）A<——>B（停）】*/
		if (KEY1==0 & KEY2==1)
		{
			mark.Mark_1 = 1;
			loop_1();
		}
		/*-功能2： KEY0 = 1 & KYE1 = 0【A<——>B（停）】*/
		if (KEY1==1 & KEY2==0)
		{
			mark.Mark_2 = 1;
			loop_2();

		}
		/*-功能3： KEY0 = 1 & KYE1 = 1【O——>C——>D——>E——>F——O】*/
		if (KEY1==1 & KEY2==1)
		{
			mark.Mark_3 = 1;
			loop_3();

		}

	}
	
}





