/******************** (C) COPYRIGHT 2014 Air Nano Team ***************************
 * 文件名  ：INIT.c
 * 描述    ：系统初始化         
 * 实验平台：HT_Hawk
 * 库版本  ：ST3.5.0
**********************************************************************************/
#include "include.h"
#include "MultiRotor_app.h"
#include "pwm_in.h"

fp32 Battery_Voltage;
Flag_t flag;   	//0
Flag1_t flag1;	//1
Flag2_t flag2;	//2
Flag3_t flag3;	//3

/*====================================================================================================*/
/*====================================================================================================*
**函数 : Bootloader_Set
**功能 : BOOT相关设置
**输入 : None
**輸出 : None
**备注 : None
**====================================================================================================*/
/*====================================================================================================*/
void Bootloader_Set(void)
{
 	u16 i[1]={0};
	
	// 设置偏移量 
	SCB->VTOR = FLASH_BASE | FLASH_EXCURSION ;
	
	STMFLASH_Read(pro_FALG_ADD,&i[0],1);
	if(i[0]!=0x0505) 
  {
		i[0]=0x0505;
		STMFLASH_Write(pro_FALG_ADD,&i[0],1);
	}		
}
/*====================================================================================================*/
/*====================================================================================================*
**函数 : Sensor_Init
**功能 : 传感器初始化
**输入 : None
**輸出 : None
**备注 : None
**====================================================================================================*/
/*====================================================================================================*/
void InitBoard(void)
{
	delay_init(72);
	Nvic_Init();
	
	/* 初始化USB设备 */
	bsp_InitUsb();
	 
	ADC1_Init();	
	OLED_Init();
	I2C_INIT();
	LED_GPIO_Config();
	USART1_Config();
	TIM5_Config();
	PWM_OUT_Config();
	PWM_IN_Config();
	NRF24L01_Init();
 	LED_SHOW();
 	FLASH_Unlock();
 	EE_Init();
}
/*====================================================================================================*/
/*====================================================================================================*
**函数 : Sensor_Init
**功能 : 传感器初始化
**输入 : None
**輸出 : None
**备注 : None
**====================================================================================================*/
/*====================================================================================================*/
void Sensor_Init(void)
{
	flag.MpuExist = InitMPU6050();
	flag.MagExist = Init_HMC5883L();
	flag.NrfExist = NRF24L01_Check();
	Ultrasonic_Config();
	NRF24L01_Mode(1);
	
	OLED_P6x8Str(0,1,"ROLL:");
	OLED_P6x8Str(0,2,"PITCH:"); 
	OLED_P6x8Str(0,3,"YAW:");
	OLED_P6x8Str(0,5,"YAW:");
	OLED_P6x8Str(0,6,"THR:");
	OLED_P6x8Str(56,5,"ROLL:");
	OLED_P6x8Str(56,6,"PITCH:"); 
}

/*====================================================================================================*/
/*====================================================================================================*
**函数 : Screen_Update
**功能 : 屏幕数据更新
**输入 : None
**輸出 : None
**备注 : None
**====================================================================================================*/
/*====================================================================================================*/
void Screen_Update(void)
{
	Dis_Float(1,40,AngE.Roll,1);
	Dis_Float(2,40,AngE.Pitch,1);
	Dis_Float(3,40,AngE.Yaw,1);
	OLED_4num(4,5,RC_Data.YAW);
	OLED_4num(4,6,RC_Data.THROTTLE);
	OLED_4num(57,5,RC_Data.ROLL);
	OLED_4num(58,6,RC_Data.PITCH);
}
//
/******************0*****************************************/
void loop(void)
{
	// 250HZ
	if(flag.Loop_250Hz)
	{
		flag.Loop_250Hz=0;
		UsbCmdPro();	//USB发送数据	
		FailSafeLEDAlarm();	//LED状态指示灯
	}	
	// 100HZ
	if(flag.Loop_100Hz)
	{
		flag.Loop_100Hz=0;
		mavlink();		//串口数据发送
		Screen_Update();//屏幕数据更新
	}
	if(flag.Loop_10Hz)
	{
		flag.Loop_10Hz=0;
		EE_SAVE_Attitude_PID();//保存姿态PID参数
	}
	if(flag.Loop_3s)//3s //前飞停止
	{
		while(flag.Loop_3s)
		{
			Sign_Video = 0;
			moto_STOP();		
		}			
	}
}

/*====================================================================================================*/
/*====================================================================================================*
**函数 : Time_slice0
**功能 : 时间片0
**输入 : None
**輸出 : None
**备注 : None
**====================================================================================================*/
/*====================================================================================================*/
void Time_slice(void)
{
	static u16 tick[]={0,0,0,0};//可通过扩展数组来增加多个功能
	tick[0]++; //USB发送数据和LED灯的状态显示
	tick[1]++; //串口发送数据和OLED液晶刷屏
	tick[2]++; //保存姿态PID参数
/////////////////////////////////////////
	tick[3]++; //停止前飞电机

	if(tick[0]>=2)	 //4ms执行一次(1/2*2)ms
	{
		tick[0] = 0;
		flag.Loop_250Hz = 1;
	}
	if(tick[1]>=5)
	{
		tick[1] = 0;
		flag.Loop_100Hz = 1;
	}	
	if(tick[2] >= 50)	
	{
		tick[2] = 0;
		flag.Loop_10Hz = 1;
	}
	if(tick[3] >= 1500)//向前飞3s	
	{
		tick[3] = 0;
		flag.Loop_3s = 1;
	}
}				   
/******************1*****************************************/
void loop_1(void)
{
	// 250HZ
	if(flag1.Loop1_250Hz)
	{
		flag1.Loop1_250Hz=0;
		UsbCmdPro();	//USB发送数据	
		FailSafeLEDAlarm();	//LED状态指示灯
	}	
	// 100HZ
	if(flag1.Loop1_100Hz)
	{
		flag1.Loop1_100Hz=0;
		mavlink();		//串口数据发送
		Screen_Update();//屏幕数据更新
	}
	if(flag1.Loop1_10Hz)
	{
		flag1.Loop1_10Hz=0;
		EE_SAVE_Attitude_PID();//保存姿态PID参数
	}
	if(flag1.Loop1_3s)//3s //前飞停止
	{
		while(Mark_forward)
		{
			moto_STOP();		
		}			
	}
	if(flag1.Loop1_7s)//7s 回飞停止位
	{
		while(flag1.Loop1_7s)
		{
			moto_STOP();		
		}			
	}

}

/*====================================================================================================*/
/*====================================================================================================*
**函数 : Time_slice1
**功能 : 时间片1
**输入 : None
**輸出 : None
**备注 : None
**====================================================================================================*/
/*====================================================================================================*/
void Time_slice_1(void)
{
	static u16 tick_1[]={0,0,0,0,0,0};//可通过扩展数组来增加多个功能
	
	tick_1[0]++; //USB发送数据和LED灯的状态显示
	tick_1[1]++; //串口发送数据和OLED液晶刷屏
	tick_1[2]++; //保存姿态PID参数
	tick_1[3]++; //停止前飞电机
	tick_1[4]++; //向前飞停止延时
	tick_1[5]++; //反向飞停止


	if(tick_1[0]>=2)	 //4ms执行一次(1/2*2)ms
	{
		tick_1[0] = 0;
		flag1.Loop1_250Hz = 1;
	}
	if(tick_1[1]>=5)
	{
		tick_1[1] = 0;
		flag1.Loop1_100Hz = 1;
	}	
	if(tick_1[2] >= 50)	
	{
		tick_1[2] = 0;
		flag1.Loop1_10Hz = 1;
	}

	if(tick_1[3] >= 1500)	
	{
		tick_1[3] = 0;
		flag1.Loop1_3s = 1;
		Mark_forward = 1;//前飞停止位
	}
	if(tick_1[4] >= 3500)	
	{
		tick_1[4] = 0;
    	Mark_forward = 0;//后飞标志位
		flag1.Loop1_3_5s = 1;	
	}
	if(tick_1[5] >= 7500)//向后飞延时3.5s
	{
		tick_1[5] = 0;
		flag1.Loop1_7s = 1;
	}

}
/******************2*****************************************/
void loop_2(void)
{
	// 250HZ
	if(flag2.Loop2_250Hz)
	{
		flag2.Loop2_250Hz=0;
		UsbCmdPro();	//USB发送数据	
		FailSafeLEDAlarm();	//LED状态指示灯
	}	
	// 100HZ
	if(flag2.Loop2_100Hz)
	{
		flag2.Loop2_100Hz=0;
		mavlink();		//串口数据发送
		Screen_Update();//屏幕数据更新
	}
	if(flag2.Loop2_10Hz)
	{
		flag2.Loop2_10Hz=0;
		EE_SAVE_Attitude_PID();//保存姿态PID参数
	}
//////////////////////////////
	if(flag2.Loop2_3s)//3s //前飞停止
	{
//		while(Mark_forward_1)
//		{
//			moto_STOP();		
//		}			
	}
	if(flag2.Loop2_7s)//7s 回飞停止位
	{
		while(1)
		{
			moto_STOP();		
		}			
	}

}

/*====================================================================================================*/
/*====================================================================================================*
**函数 : Time_slice2
**功能 : 时间片2
**输入 : None
**輸出 : None
**备注 : None
**====================================================================================================*/
/*====================================================================================================*/
void Time_slice_2(void)
{
	static u16 tick_2[]={0,0,0,0,0};//可通过扩展数组来增加多个功能
	
	tick_2[0]++; //USB发送数据和LED灯的状态显示
	tick_2[1]++; //串口发送数据和OLED液晶刷屏
	tick_2[2]++; //保存姿态PID参数
	tick_2[3]++; //停止前飞电机
	tick_2[4]++; //返航延时


	if(tick_2[0]>=2)	 //4ms执行一次(1/2*2)ms
	{
		tick_2[0] = 0;
		flag2.Loop2_250Hz = 1;
	}
	if(tick_2[1]>=5)
	{
		tick_2[1] = 0;
		flag2.Loop2_100Hz = 1;
	}	
	if(tick_2[2] >= 50)	
	{
		tick_2[2] = 0;
		flag2.Loop2_10Hz = 1;
	}
	if(tick_2[3] >= 1500)	
	{
		tick_2[3] = 0;
		flag2.Loop2_3s = 1;
		Mark_forward_1 = 0;		//返航
	}
	if(tick_2[4] >=3250)	
	{
		tick_2[4] = 0;
		flag2.Loop2_7s = 1;
	}

}
/******************3*****************************************/
void loop_3(void)
{
	// 250HZ
	if(flag3.Loop3_250Hz)
	{
		flag3.Loop3_250Hz=0;
		UsbCmdPro();	//USB发送数据	
		FailSafeLEDAlarm();	//LED状态指示灯
	}	
	// 100HZ
	if(flag3.Loop3_100Hz)
	{
		flag3.Loop3_100Hz=0;
		mavlink();		//串口数据发送
		Screen_Update();//屏幕数据更新
	}
	if(flag3.Loop3_10Hz)
	{
		flag3.Loop3_10Hz=0;
		EE_SAVE_Attitude_PID();//保存姿态PID参数
	}
//	if(flag3.Loop3_5s)//5s 回飞停止位
//	{
//		while(1)
//		{
//			moto_STOP();		
//		}flag3.Loop3_2s			
//	}
	if(flag3.Loop3_5s)//5s 回飞停止位
	{
		while(1)
		{
			moto_STOP();		
		}			
	}
}

/*====================================================================================================*/
/*====================================================================================================*
**函数 : Time_slice3
**功能 : 时间片3
**输入 : None
**輸出 : None
**备注 : None
**====================================================================================================*/
/*====================================================================================================*/
void Time_slice_3(void)
{
	static u16 tick_3[]={0,0,0,0,0,0,0,0,0,0,0,0};//可通过扩展数组来增加多个功能
	
	tick_3[0]++; //USB发送数据和LED灯的状态显示
	tick_3[1]++; //串口发送数据和OLED液晶刷屏
	tick_3[2]++; //保存姿态PID参数
	tick_3[3]++; //右转
	tick_3[4]++; //前进
	tick_3[5]++; //左转
	tick_3[6]++; //后退
	tick_3[7]++; //停止

	{
		if(tick_3[0]>=2)	 //4ms执行一次(1/2*2)ms
		{
			tick_3[0] = 0;
			flag3.Loop3_250Hz = 1;
		}
		if(tick_3[1]>=5)
		{
			tick_3[1] = 0;
			flag3.Loop3_100Hz = 1;
		}	
		if(tick_3[2] >= 50)	
		{
			tick_3[2] = 0;
			flag3.Loop3_10Hz = 1;
		}
	}
	{
		if(tick_3[3] >= 500)	
		{
			tick_3[3] = 0;
			flag3.Loop3_1s = 1;
			Mark_forward_2 = 2;		//向前

		}
		if(tick_3[4] >= 2000)	
		{
			tick_3[4] = 0;
			flag3.Loop3_2s = 1;
			Mark_forward_2 = 3;		//左转

		}	
		if(tick_3[5] >= 3000)	
		{
			tick_3[5] = 0;
			flag3.Loop3_3s = 1;
			Mark_forward_2 = 4;		//后退

		}	
		if(tick_3[6] >= 4000)	
		{
			tick_3[6] = 0;
			flag3.Loop3_4s = 1;
			Mark_forward_2 = 5;		//右转

		}
		if(tick_3[7] >= 4500)	
		{
			tick_3[7] = 0;
			flag3.Loop3_5s = 1;		//停止

		}	
	
	}


}
/******************************END****FILE*************************************/
